degenegge-code/am263/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_S" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263Px@10.02.00"
 * @v2CliArgs --device "AM263P4-Q1" --package "NFBGA (ZCZ-S)" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263Px@10.02.00"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc             = scripting.addModule("/drivers/adc/adc");
const adc1            = adc.addInstance();
const ecap            = scripting.addModule("/drivers/ecap/ecap");
const ecap1           = ecap.addInstance();
const epwm            = scripting.addModule("/drivers/epwm/epwm");
const epwm1           = epwm.addInstance();
const epwm2           = epwm.addInstance();
const epwm3           = epwm.addInstance();
const epwm4           = epwm.addInstance();
const epwm5           = epwm.addInstance();
const epwm6           = epwm.addInstance();
const epwm7           = epwm.addInstance();
const eqep            = scripting.addModule("/drivers/eqep/eqep", {}, false);
const eqep1           = eqep.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();
const section12       = section.addInstance();
const epwm_xbar       = scripting.addModule("/xbar/epwm_xbar/epwm_xbar", {}, false);
const epwm_xbar1      = epwm_xbar.addInstance();
const epwm_xbar2      = epwm_xbar.addInstance();
const input_xbar      = scripting.addModule("/xbar/input_xbar/input_xbar", {}, false);
const input_xbar1     = input_xbar.addInstance();
const input_xbar2     = input_xbar.addInstance();
const int_xbar        = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1       = int_xbar.addInstance();
const int_xbar2       = int_xbar.addInstance();
const int_xbar3       = int_xbar.addInstance();
const int_xbar4       = int_xbar.addInstance();
const int_xbar5       = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.soc0Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc1Trigger         = "ADC_TRIGGER_EPWM0_SOCB";
adc1.enableTDMA          = false;
adc1.enableConverter     = true;
adc1.socHighPriorityMode = "ADC_PRI_SOC0_HIPRI";
adc1.$name               = "CONFIG_ADC1";
adc1.ADC.$assign         = "ADC1";
adc1.ADC.AIN0.$assign    = "ADC1_AIN0";

ecap1.$name               = "CONFIG_ECAP0";
ecap1.ecapInput           = "ECAP_INPUT_INPUTXBAR0";
ecap1.useInterrupts       = false;
ecap1.dmaSource           = "ECAP_CAP_MODE_DMA_TRIGGER_SRC_CEVT2";
ecap1.eventStop           = "ECAP_EVENT_4";
ecap1.syncOutMode         = "ECAP_SYNC_OUT_DISABLED";
ecap1.eventOnePolarity    = "ECAP_EVNT_FALLING_EDGE";
ecap1.eventThreePolarity  = "ECAP_EVNT_FALLING_EDGE";
ecap1.resetCounters       = true;
ecap1.counterResetOnEvent = ["ECAP_EVENT_1","ECAP_EVENT_2","ECAP_EVENT_3","ECAP_EVENT_4"];
ecap1.reArm               = true;

epwm.enableWarning = true;
epwm.enableInfo    = true;

epwm1.$name                                                      = "CONFIG_EPWM0";
epwm1.epwmEventTrigger_enableInterrupt                           = true;
epwm1.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO      = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_PERIOD    = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmTimebase_clockDiv                                      = "EPWM_CLOCK_DIVIDER_2";
epwm1.epwmTimebase_period                                        = 1000;
epwm1.epwmCounterCompare_cmpA                                    = 50;
epwm1.epwmCounterCompare_cmpB                                    = 50;
epwm1.epwmCounterCompare_cmpC                                    = 50;
epwm1.epwmCounterCompare_cmpD                                    = 50;
epwm1.epwmCounterCompare_cmpCGld                                 = true;
epwm1.epwmCounterCompare_cmpDGld                                 = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm1.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_ETINTMIX";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_MIXED_EVENT";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerMixedSource             = ["EPWM_INT_MIX_TBCTR_D_CMPD","EPWM_INT_MIX_TBCTR_U_CMPD"];
epwm1.epwmEventTrigger_interruptMixedSource                      = ["EPWM_INT_MIX_TBCTR_D_CMPB","EPWM_INT_MIX_TBCTR_PERIOD","EPWM_INT_MIX_TBCTR_U_CMPA","EPWM_INT_MIX_TBCTR_ZERO"];
epwm1.epwmEventTrigger_interruptEventCount                       = "1";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerMixedSource             = ["EPWM_INT_MIX_TBCTR_D_CMPC","EPWM_INT_MIX_TBCTR_D_CMPD","EPWM_INT_MIX_TBCTR_U_CMPC","EPWM_INT_MIX_TBCTR_U_CMPD"];
epwm1.EPWM.$assign                                               = "EPWM0";
epwm1.EPWM.A.$assign                                             = "EPWM0_A";
epwm1.EPWM.B.$assign                                             = "EPWM0_B";

